---
type: CurveNode
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# CurveNode

`Autodesk.Revit.DB.CurveNode` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetCurve | 2016 | `public Curve GetCurve ()` |